poisellePlacasPlanas/Re-10/m02/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    entrada
    {            
        type            fixedValue;
        value           uniform (1 0 0);
    }
    saida
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           $internalField;
    }
    parede
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    centro
    {
    	type	symmetryPlane;
    }
    zPlan
    {
        type            empty;
    }
}

// ************************************************************************* //
